Revit 2026 API

# CircuitLoadCalculationMethod Enumeration

---

Methods to calculate circuit loads

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CircuitLoadCalculationMethod
```
```vb
Public Enumeration CircuitLoadCalculationMethod
```
```cpp
public enum class CircuitLoadCalculationMethod
```
```fsharp
type CircuitLoadCalculationMethod
```

| Member name | Value | Description |
| --- | --- | --- |
| SumApparentLoad | 1 | Sum apparent power. |
| SumTrueLoadAndReactiveLoad | 0 | Sum true power and reactive power. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace